In [1]:
import pandas as pd

In [2]:
users = pd.read_csv("../data/ml-1m/users.dat", sep="::", engine="python", header=None)
movies = pd.read_csv("../data/ml-1m/movies.dat", sep="::", engine="python", header=None)
ratings = pd.read_csv("../data/ml-1m/ratings.dat", sep="::", engine="python", header=None)

users.columns = ["user_id", "gender", "age", "occupation", "zip"]
movies.columns = ["movie_id", "title", "genre"]
ratings.columns = ["user_id", "movie_id", "rating", "timestamp"]

users = users.drop("zip", axis=1)

In [3]:
ages = {
    1:  "Under 18",
    18:  "18-24",
    25:  "25-34",
    35:  "35-44",
    45:  "45-49",
    50:  "50-55",
    56:  "56+",
}

occupations = {
	0:  "other",
	1:  "academic/educator",
	2:  "artist",
	3:  "clerical/admin",
	4:  "college/grad student",
	5:  "customer service",
	6:  "doctor/health care",
	7:  "executive/managerial",
	8:  "farmer",
	9:  "homemaker",
	10:  "K-12 student",
	11:  "lawyer",
	12:  "programmer",
	13:  "retired",
	14:  "sales/marketing",
	15:  "scientist",
	16:  "self-employed",
	17:  "technician/engineer",
	18:  "tradesman/craftsman",
	19:  "unemployed",
	20:  "writer",
}

In [4]:
users.age = users.age.replace(ages)
users.occupation = users.occupation.replace(occupations)

In [5]:
users

      user_id gender       age            occupation
0           1      F  Under 18          K-12 student
1           2      M       56+         self-employed
2           3      M     25-34             scientist
3           4      M     45-49  executive/managerial
4           5      M     25-34                writer
...       ...    ...       ...                   ...
6035     6036      F     25-34             scientist
6036     6037      F     45-49     academic/educator
6037     6038      F       56+     academic/educator
6038     6039      F     45-49                 other
6039     6040      M     25-34    doctor/health care

[6040 rows x 4 columns]

In [6]:
movies["year"] = movies.title.str.extract("\((\d{4})\)", expand=True)
movies.year = movies.year.apply(lambda x: str(int(x) // 10 * 10))

In [61]:
def to_sequence(v):
    return " ".join(map(str, list(v)))
raw_sequences = ratings.groupby("user_id").movie_id.apply(to_sequence)

In [133]:
raw_sequences.to_csv("../data/ml-1m/raw_sequences.csv")
movies.to_csv("../data/ml-1m/movies.csv", index=False)
users.to_csv("../data/ml-1m/users.csv", index=False)